<?php

use Illuminate\Database\Seeder;

class FinancesSeeder extends Seeder
{
  /**
   * Run the database seeds.
   *
   * @return void
   */
  public function run()
  {
    $items = [
      [
        "lat" => 43.217443,
        "long" => 76.905881,
        "name" => "Атакент"
      ],
      [
        "lat" => 43.240216,
        "long" => 76.904879,
        "name" => "Globus, многофункциональный комплекс"
      ],
      [
        "lat" => 43.265059,
        "long" => 76.947394,
        "name" => "Жетысу, бизнес-центр"
      ],
      [
        "lat" => 43.236648,
        "long" => 76.915618,
        "name" => "Almaty Towers, бизнес-центр"
      ],
      [
        "lat" => 43.246412,
        "long" => 76.925455,
        "name" => "Бизнес-Сити, бизнес-центр"
      ],
      [
        "lat" => 43.261719,
        "long" => 76.929814,
        "name" => "Жибек Жолы, бизнес-центр"
      ],
      [
        "lat" => 43.239373,
        "long" => 76.891799,
        "name" => "Алатау, бизнес-центр"
      ],
      [
        "lat" => 43.251594,
        "long" => 76.933833,
        "name" => "Алтын Заман, бизнес-центр"
      ],
      [
        "lat" => 43.262289,
        "long" => 76.95588,
        "name" => "Квартал, бизнес-центр"
      ],
      [
        "lat" => 43.258019,
        "long" => 76.932564,
        "name" => "Майсат, бизнес-центр"
      ],
      [
        "lat" => 43.235915,
        "long" => 76.881628,
        "name" => "VERUM, бизнес-центр"
      ],
      [
        "lat" => 43.253276,
        "long" => 76.939694,
        "name" => "Kaisar Plaza, торгово-офисный центр"
      ],
      [
        "lat" => 43.219596,
        "long" => 76.880092,
        "name" => "Навои, бизнес-центр"
      ],
      [
        "lat" => 43.248123,
        "long" => 76.905317,
        "name" => "Карасай, бизнес-центр"
      ],
      [
        "lat" => 43.253815,
        "long" => 76.924758,
        "name" => "Толе би, бизнес-центр"
      ],
      [
        "lat" => 43.252328,
        "long" => 76.956666,
        "name" => "Кен Дала, бизнес-центр"
      ],
      [
        "lat" => 43.236837,
        "long" => 76.911283,
        "name" => "Сатти, бизнес-центр"
      ],
      [
        "lat" => 43.225523,
        "long" => 76.960986,
        "name" => "Премьер Алатау, бизнес-центр"
      ],
      [
        "lat" => 43.229796,
        "long" => 76.932819,
        "name" => "Алатау Гранд, бизнес-центр"
      ],
      [
        "lat" => 43.252134,
        "long" => 76.94752,
        "name" => "Аltstadt, бизнес-центр"
      ],
      [
        "lat" => 43.245294,
        "long" => 76.903877,
        "name" => "Almaty Residence, бизнес-центр"
      ],
      [
        "lat" => 43.256369,
        "long" => 76.910744,
        "name" => "NOMAD, бизнес-центр"
      ],
      [
        "lat" => 43.231593,
        "long" => 76.960276,
        "name" => "Green Tower, бизнес-центр"
      ],
      [
        "lat" => 43.260999,
        "long" => 76.956548,
        "name" => "Агентство Барьер, бизнес-центр"
      ],
      [
        "lat" => 43.247891,
        "long" => 76.868574,
        "name" => "Каусар, бизнес-центр"
      ],
      [
        "lat" => 43.224137,
        "long" => 76.953463,
        "name" => "Сарканд, бизнес-центр"
      ],
      [
        "lat" => 43.255349,
        "long" => 76.864162,
        "name" => "ASPARA, бизнес-центр"
      ],
      [
        "lat" => 43.23778,
        "long" => 76.897399,
        "name" => "TIME, бизнес-центр"
      ],
      [
        "lat" => 43.209042,
        "long" => 76.912648,
        "name" => "Аврора, бизнес-центр"
      ],
      [
        "lat" => 43.262253,
        "long" => 76.916567,
        "name" => "Parasat, бизнес-центр"
      ],
      [
        "lat" => 43.231877,
        "long" => 76.958999,
        "name" => "Ardin, бизнес-центр"
      ],
      [
        "lat" => 43.219102,
        "long" => 76.929074,
        "name" => "Esentai Tower, бизнес-центр"
      ],
      [
        "lat" => 43.263139,
        "long" => 76.91441,
        "name" => "ДАНАИДА, бизнес-центр"
      ],
      [
        "lat" => 43.282481,
        "long" => 76.948385,
        "name" => "Green Hill, бизнес-центр"
      ],
      [
        "lat" => 43.270723,
        "long" => 76.901755,
        "name" => "АвтоБизнесЦентр на Бродского, бизнес-центр"
      ],
      [
        "lat" => 43.253558,
        "long" => 76.902611,
        "name" => "Bereket, бизнес-центр"
      ],
      [
        "lat" => 43.208762,
        "long" => 76.899668,
        "name" => "Гагарин, бизнес-центр"
      ],
      [
        "lat" => 43.270548,
        "long" => 76.952634,
        "name" => "JBS SAYAHAT, бизнес-центр"
      ],
      [
        "lat" => 43.205078,
        "long" => 76.890841,
        "name" => "Capital Tower, бизнес-центр"
      ],
      [
        "lat" => 43.239054,
        "long" => 76.947352,
        "name" => "Республика, бизнес-центр"
      ],
      [
        "lat" => 43.23973,
        "long" => 76.823598,
        "name" => "Car City, бизнес-центр"
      ],
      [
        "lat" => 43.26601,
        "long" => 76.864092,
        "name" => "Массагет, бизнес-центр"
      ],
      [
        "lat" => 43.235779,
        "long" => 76.848871,
        "name" => "S.K.K., бизнес-центр"
      ],
      [
        "lat" => 43.24462,
        "long" => 76.926375,
        "name" => "Алтын Гасыр, бизнес-центр"
      ],
      [
        "lat" => 43.270398,
        "long" => 76.95953,
        "name" => "Ambassador Plus, бизнес центр"
      ],
      [
        "lat" => 43.215824,
        "long" => 76.966732,
        "name" => "Бизнес-центр"
      ],
      [
        "lat" => 43.230725,
        "long" => 76.868988,
        "name" => "КазИнвестСтрой, бизнес-центр"
      ],
      [
        "lat" => 43.231795,
        "long" => 76.885879,
        "name" => "Жел Тау, бизнес-центр"
      ],
      [
        "lat" => 43.22693,
        "long" => 76.889009,
        "name" => "Ambassador Towers, бизнес-центр"
      ],
      [
        "lat" => 43.267766,
        "long" => 76.87474,
        "name" => "Нурлы Туран, бизнес-центр"
      ],
      [
        "lat" => 43.250402,
        "long" => 76.887013,
        "name" => "Дария, бизнес-центр"
      ],
      [
        "lat" => 43.270273,
        "long" => 76.933437,
        "name" => "Ясмин НС, бизнес-центр"
      ],
      [
        "lat" => 43.284139,
        "long" => 76.934896,
        "name" => "BOTAN, бизнес-центр"
      ],
      [
        "lat" => 43.237754,
        "long" => 76.957053,
        "name" => "Танил, бизнес-центр"
      ],
      [
        "lat" => 43.226209,
        "long" => 76.935253,
        "name" => "Garant, бизнес-центр"
      ],
      [
        "lat" => 43.227485,
        "long" => 76.905245,
        "name" => "NURIKON, бизнес-центр"
      ],
      [
        "lat" => 43.269683,
        "long" => 76.923736,
        "name" => "Жетысу, бизнес-центр"
      ],
      [
        "lat" => 43.288525,
        "long" => 76.981037,
        "name" => "Bliss, бизнес-центр"
      ],
      [
        "lat" => 43.219071,
        "long" => 76.846663,
        "name" => "NURSAT, бизнес-центр"
      ],
      [
        "lat" => 43.24785,
        "long" => 76.840662,
        "name" => "Эталон, бизнес-центр"
      ],
      [
        "lat" => 43.261886,
        "long" => 76.858779,
        "name" => "Шипа, бизнес-центр"
      ],
      [
        "lat" => 43.211719,
        "long" => 76.944287,
        "name" => "Lucrum, бизнес-центр"
      ],
      [
        "lat" => 43.305099,
        "long" => 76.940501,
        "name" => "Diamond Center, многофункциональный комплекс"
      ],
      [
        "lat" => 43.274508,
        "long" => 76.977489,
        "name" => "На Татарке, бизнес-центр"
      ],
      [
        "lat" => 43.273746,
        "long" => 76.946601,
        "name" => "Мерей, бизнес-центр"
      ],
      [
        "lat" => 43.255696,
        "long" => 76.839225,
        "name" => "MEDNI, бизнес-центр"
      ],
      [
        "lat" => 43.336175,
        "long" => 76.948426,
        "name" => "Sibel, бизнес-центр"
      ],
      [
        "lat" => 43.253886,
        "long" => 76.820684,
        "name" => "Nurkent, торгово-административный комплекс"
      ],
      [
        "lat" => 43.230229,
        "long" => 76.85368,
        "name" => "Болашак, бизнес-центр"
      ],
      [
        "lat" => 43.291522,
        "long" => 77.014508,
        "name" => "Forte, бизнес-центр"
      ],
      [
        "lat" => 43.210011,
        "long" => 76.969231,
        "name" => "Avenue 310, бизнес центр"
      ],
      [
        "lat" => 43.343792,
        "long" => 76.940367,
        "name" => "Vanguard Prosperitas, бизнес-центр"
      ],
      [
        "lat" => 43.221185,
        "long" => 76.896733,
        "name" => "Tengri, бизнес-центр"
      ],
      [
        "lat" => 43.260309,
        "long" => 76.892068,
        "name" => "Бизнес-парк на Райымбека"
      ],
      [
        "lat" => 43.193235,
        "long" => 76.921655,
        "name" => "Sirius, бизнес-центр"
      ],
      [
        "lat" => 43.338936,
        "long" => 76.982545,
        "name" => "Меркур, торговый дом"
      ],
      [
        "lat" => 43.314788,
        "long" => 76.956777,
        "name" => "Баум Парк, бизнес-центр"
      ],
      [
        "lat" => 43.323927,
        "long" => 76.907882,
        "name" => "Авад-АРА, бизнес-центр"
      ],
      [
        "lat" => 43.251046,
        "long" => 76.966903,
        "name" => "КБ 10, бизнес-центр"
      ],
      [
        "lat" => 43.236185,
        "long" => 76.89429,
        "name" => "Бизнес-центр"
      ],
      [
        "lat" => 43.262115,
        "long" => 76.891984,
        "name" => "ZAT, бизнес-центр"
      ],
      [
        "lat" => 43.292547,
        "long" => 76.984097,
        "name" => "Скай, бизнес-центр"
      ],
      [
        "lat" => 43.26135,
        "long" => 76.89536,
        "name" => "АТМ, бизнес-центр"
      ],
      [
        "lat" => 43.24288,
        "long" => 76.847808,
        "name" => "IBG, бизнес-центр"
      ]
    ];

    foreach ($items as $item) {
      \App\Finance::firstOrCreate($item);
    }
  }
}
