<?php

use Illuminate\Database\Seeder;

class MedsSeeder extends Seeder
{
  /**
   * Run the database seeds.
   *
   * @return void
   */
  public function run()
  {
    $meds = [
      [
        "lat" => 43.239376,
        "long" => 76.872024,
        "name" => "Биоритм, медицинский центр"
      ],
      [
        "lat" => 43.226746,
        "long" => 76.961726,
        "name" => "Городская клиническая больница №5"
      ],
      [
        "lat" => 43.25534,
        "long" => 76.929167,
        "name" => "Городская больница скорой неотложной помощи"
      ],
      [
        "lat" => 43.214273,
        "long" => 76.896541,
        "name" => "Достар Мед, сеть клиник"
      ],
      [
        "lat" => 43.231966,
        "long" => 76.910775,
        "name" => "Центр детской неотложной медицинской помощи"
      ],
      [
        "lat" => 43.235084,
        "long" => 76.91107,
        "name" => "Центральная городская клиническая больница"
      ],
      [
        "lat" => 43.241228,
        "long" => 76.923277,
        "name" => "Казахский НИИ онкологии и радиологии"
      ],
      [
        "lat" => 43.260358,
        "long" => 76.935218,
        "name" => "SEMA Hospital Алматы, клиника"
      ],
      [
        "lat" => 43.22756,
        "long" => 76.962623,
        "name" => "Городская клиническая больница №5"
      ],
      [
        "lat" => 43.205012,
        "long" => 76.917438,
        "name" => "Научный центр педиатрии и детской хирургии"
      ],
      [
        "lat" => 43.230565,
        "long" => 76.840611,
        "name" => "Сункар, сеть медицинских центров"
      ],
      [
        "lat" => 43.232535,
        "long" => 76.912593,
        "name" => "Детская городская клиническая инфекционная больница"
      ],
      [
        "lat" => 43.235669,
        "long" => 76.912913,
        "name" => "Городская клиническая инфекционная больница им. И.С. Жекеновой"
      ],
      [
        "lat" => 43.253996,
        "long" => 76.92809,
        "name" => "Городской кардиологический центр"
      ],
      [
        "lat" => 43.247187,
        "long" => 76.944594,
        "name" => "Центральная клиническая больница Управления делами Президента РК"
      ],
      [
        "lat" => 43.283256,
        "long" => 76.989869,
        "name" => "Алматинская многопрофильная клиническая больница"
      ],
      [
        "lat" => 43.319085,
        "long" => 76.962666,
        "name" => "Городская клиническая больница №4"
      ],
      [
        "lat" => 43.232748,
        "long" => 76.855968,
        "name" => "Детская городская клиническая больница №2"
      ],
      [
        "lat" => 43.255123,
        "long" => 76.919262,
        "name" => "CARDIOS, медицинский центр"
      ],
      [
        "lat" => 43.232744,
        "long" => 76.911996,
        "name" => "Детская городская клиническая инфекционная больница"
      ],
      [
        "lat" => 43.190035,
        "long" => 76.832412,
        "name" => "Городская поликлиника №26"
      ],
      [
        "lat" => 43.180474,
        "long" => 76.813699,
        "name" => "Аксай, Республиканская детская клиническая больница"
      ],
      [
        "lat" => 43.233743,
        "long" => 76.917999,
        "name" => "Городская больница сестринского ухода"
      ],
      [
        "lat" => 43.326883,
        "long" => 76.950483,
        "name" => "Алматинская железнодорожная больница"
      ],
      [
        "lat" => 43.299853,
        "long" => 76.816663,
        "name" => "Городская клиническая инфекционная больница им. И.С. Жекеновой"
      ]
    ];

    foreach ($meds as $item) {
      \App\Med::firstOrCreate($item);
    }
  }
}
