<?php

use Illuminate\Database\Seeder;

class SchoolsSeeder extends Seeder
{
  /**
   * Run the database seeds.
   *
   * @return void
   */
  public function run()
  {
    $schools = [
      [
        "lat"=> 43.206619,
        "long"=> 76.92309,
        "name"=> "Kazakhstan International School, международная частная школа"
      ],
      [
        "lat"=> 43.179719,
        "long"=> 76.890592,
        "name"=> "Зердеш, частная казахская школа"
      ],
      [
        "lat"=> 43.207568,
        "long"=> 76.810999,
        "name"=> "Марьям, лингво-математическая школа"
      ],
      [
        "lat"=> 43.240317,
        "long"=> 76.862241,
        "name"=> "Новая Школа"
      ],
      [
        "lat"=> 43.222137,
        "long"=> 76.938232,
        "name"=> "Сенім, классическая школа"
      ],
      [
        "lat"=> 43.206574,
        "long"=> 76.870502,
        "name"=> "Школа Архимеда, частная школа"
      ],
      [
        "lat"=> 43.269401,
        "long"=> 76.946637,
        "name"=> "ҮРКЕР мектебі, частная казахская школа"
      ],
      [
        "lat"=> 43.19107,
        "long"=> 76.92126,
        "name"=> "NGS, школа нового поколения"
      ],
      [
        "lat"=> 43.21801,
        "long"=> 76.870514,
        "name"=> "Bilimkana-Almaty School, частная школа"
      ],
      [
        "lat"=> 43.241993,
        "long"=> 76.94798,
        "name"=> "EdAccess, Британский аккредитованный учебный и экзаменационный центр"
      ],
      [
        "lat"=> 43.230263,
        "long"=> 76.883484,
        "name"=> "EdAccess, Британский аккредитованный учебный и экзаменационный центр"
      ],
      [
        "lat"=> 43.214536,
        "long"=> 76.951505,
        "name"=> "Назарбаев Зияткерлік мектебі"
      ],
      [
        "lat"=> 43.209411,
        "long"=> 76.887247,
        "name"=> "Tamos Education, частная физико-математическая школа"
      ],
      [
        "lat"=> 43.249473,
        "long"=> 76.904285,
        "name"=> "Общеобразовательная школа №124"
      ],
      [
        "lat"=> 43.235139,
        "long"=> 76.8863,
        "name"=> "Общеобразовательная школа №65"
      ],
      [
        "lat"=> 43.24556,
        "long"=> 76.900077,
        "name"=> "Общеобразовательная школа №128 им. М. Ауезова"
      ],
      [
        "lat"=> 43.226352,
        "long"=> 76.953283,
        "name"=> "Частная школа им. Шокана Уалиханова"
      ],
      [
        "lat"=> 43.202026,
        "long"=> 76.897485,
        "name"=> "Школа-лицей №146"
      ],
      [
        "lat"=> 43.257054,
        "long"=> 76.920882,
        "name"=> "Общеобразовательная школа №95"
      ],
      [
        "lat"=> 43.234061,
        "long"=> 76.926394,
        "name"=> "Престиж, частная школа"
      ],
      [
        "lat"=> 43.248547,
        "long"=> 76.909332,
        "name"=> "Авторская школа Жании Аубакировой"
      ],
      [
        "lat"=> 43.203429,
        "long"=> 76.902256,
        "name"=> "Общеобразовательная школа №125"
      ],
      [
        "lat"=> 43.266824,
        "long"=> 76.893306,
        "name"=> "Общеобразовательная школа №109"
      ],
      [
        "lat"=> 43.262255,
        "long"=> 76.959175,
        "name"=> "Общеобразовательная школа №19"
      ],
      [
        "lat"=> 43.216944,
        "long"=> 76.88878,
        "name"=> "Общеобразовательная школа №63"
      ],
      [
        "lat"=> 43.168274,
        "long"=> 76.910439,
        "name"=> "Tamos Education, частная физико-математическая школа"
      ],
      [
        "lat"=> 43.260501,
        "long"=> 76.957638,
        "name"=> "Көкіл, частная школа"
      ],
      [
        "lat"=> 43.217119,
        "long"=> 76.932816,
        "name"=> "Haileybury Almaty British School, частная Британская школа"
      ],
      [
        "lat"=> 43.230068,
        "long"=> 76.91273,
        "name"=> "Общеобразовательная школа №10"
      ],
      [
        "lat"=> 43.272681,
        "long"=> 76.982106,
        "name"=> "Общеобразовательная школа №64"
      ],
      [
        "lat"=> 43.270434,
        "long"=> 76.951219,
        "name"=> "Общеобразовательная школа №52"
      ],
      [
        "lat"=> 43.25933,
        "long"=> 76.921208,
        "name"=> "Общеобразовательная школа №16"
      ],
      [
        "lat"=> 43.254441,
        "long"=> 76.881272,
        "name"=> "Общеобразовательная школа №58"
      ],
      [
        "lat"=> 43.254259,
        "long"=> 76.967258,
        "name"=> "Общеобразовательная школа №29"
      ],
      [
        "lat"=> 43.273691,
        "long"=> 76.963173,
        "name"=> "Общеобразовательная школа №2"
      ],
      [
        "lat"=> 43.273659,
        "long"=> 76.954876,
        "name"=> "Общеобразовательная школа-лицей №143 им. Суюнбая"
      ],
      [
        "lat"=> 43.253667,
        "long"=> 76.870058,
        "name"=> "Общеобразовательная школа №96"
      ],
      [
        "lat"=> 43.256263,
        "long"=> 76.879162,
        "name"=> "Общеобразовательная школа №167"
      ],
      [
        "lat"=> 43.239522,
        "long"=> 76.887853,
        "name"=> "ДОСТАР, международная школа-лицей"
      ],
      [
        "lat"=> 43.218071,
        "long"=> 76.949481,
        "name"=> "Общеобразовательная школа №77"
      ],
      [
        "lat"=> 43.256674,
        "long"=> 76.912156,
        "name"=> "Alma School, школа предпринимательского образования"
      ],
      [
        "lat"=> 43.283454,
        "long"=> 77.000493,
        "name"=> "Школа-гимназия №172"
      ],
      [
        "lat"=> 43.228213,
        "long"=> 76.931619,
        "name"=> "Zerde, частная школа"
      ],
      [
        "lat"=> 43.225639,
        "long"=> 76.868705,
        "name"=> "Общеобразовательная школа №116"
      ],
      [
        "lat"=> 43.242683,
        "long"=> 76.888567,
        "name"=> "Общеобразовательная школа №67"
      ],
      [
        "lat"=> 43.243162,
        "long"=> 76.880381,
        "name"=> "Общеобразовательная школа №75 им. Ш. Кудайбердыулы"
      ],
      [
        "lat"=> 43.227692,
        "long"=> 76.897703,
        "name"=> "Общеобразовательная школа №93"
      ],
      [
        "lat"=> 43.263315,
        "long"=> 76.982817,
        "name"=> "High Tech Academy, частная инновационная школа"
      ],
      [
        "lat"=> 43.221268,
        "long"=> 76.86399,
        "name"=> "Общеобразовательная школа №9"
      ],
      [
        "lat"=> 43.227156,
        "long"=> 76.86843,
        "name"=> "Школа-лицей №119"
      ],
      [
        "lat"=> 43.228703,
        "long"=> 76.907802,
        "name"=> "Общеобразовательная школа №69"
      ],
      [
        "lat"=> 43.242019,
        "long"=> 76.900732,
        "name"=> "Общеобразовательная школа №135"
      ],
      [
        "lat"=> 43.192081,
        "long"=> 76.967601,
        "name"=> "Общеобразовательная школа №47"
      ],
      [
        "lat"=> 43.235248,
        "long"=> 76.915983,
        "name"=> "Магистр, частная школа"
      ],
      [
        "lat"=> 43.18806,
        "long"=> 76.925595,
        "name"=> "Общеобразовательная школа №183"
      ],
      [
        "lat"=> 43.260567,
        "long"=> 76.878801,
        "name"=> "Общеобразовательная школа №114"
      ],
      [
        "lat"=> 43.234213,
        "long"=> 76.902457,
        "name"=> "Международная школа г. Алматы, Фонд образования Н. Назарбаева"
      ],
      [
        "lat"=> 43.271049,
        "long"=> 76.928679,
        "name"=> "Общеобразовательная школа №3"
      ],
      [
        "lat"=> 43.277392,
        "long"=> 76.987334,
        "name"=> "Общеобразовательная школа №99"
      ],
      [
        "lat"=> 43.194032,
        "long"=> 76.906295,
        "name"=> "Общеобразовательная школа №70"
      ],
      [
        "lat"=> 43.267006,
        "long"=> 76.897877,
        "name"=> "Общеобразовательная школа №66"
      ],
      [
        "lat"=> 43.290272,
        "long"=> 76.95275,
        "name"=> "Общеобразовательная школа №102"
      ],
      [
        "lat"=> 43.215738,
        "long"=> 76.949978,
        "name"=> "Данашым, физико-математическая школа"
      ],
      [
        "lat"=> 43.193792,
        "long"=> 76.879256,
        "name"=> "Мирас, международная школа"
      ],
      [
        "lat"=> 43.214805,
        "long"=> 76.878095,
        "name"=> "Общеобразовательная школа №72"
      ],
      [
        "lat"=> 43.243393,
        "long"=> 76.96649,
        "name"=> "STEAM SCHOOL, частная школа"
      ],
      [
        "lat"=> 43.226754,
        "long"=> 76.858041,
        "name"=> "Galaxy, международная школа"
      ],
      [
        "lat"=> 43.301503,
        "long"=> 76.95943,
        "name"=> "Общеобразовательная школа №20"
      ],
      [
        "lat"=> 43.293717,
        "long"=> 76.915563,
        "name"=> "Общеобразовательная школа №112"
      ],
      [
        "lat"=> 43.210677,
        "long"=> 76.874707,
        "name"=> "Общеобразовательная школа №127"
      ],
      [
        "lat"=> 43.282309,
        "long"=> 76.974803,
        "name"=> "Общеобразовательная школа №100"
      ],
      [
        "lat"=> 43.284347,
        "long"=> 76.941215,
        "name"=> "Общеобразовательная школа №57"
      ],
      [
        "lat"=> 43.262237,
        "long"=> 76.92953,
        "name"=> "ДОСТАР, международная школа-лицей"
      ],
      [
        "lat"=> 43.288779,
        "long"=> 76.977171,
        "name"=> "Общеобразовательная школа №98"
      ],
      [
        "lat"=> 43.22624,
        "long"=> 76.851701,
        "name"=> "Общеобразовательная школа №122"
      ],
      [
        "lat"=> 43.225679,
        "long"=> 76.962532,
        "name"=> "Школа предпринимателей, частная школа"
      ],
      [
        "lat"=> 43.26054,
        "long"=> 76.885879,
        "name"=> "Общеобразовательная школа №14"
      ],
      [
        "lat"=> 43.19966,
        "long"=> 76.877836,
        "name"=> "Общеобразовательная школа №145 им. Аль-Фараби"
      ],
      [
        "lat"=> 43.233884,
        "long"=> 76.857293,
        "name"=> "Общеобразовательная школа №104"
      ],
      [
        "lat"=> 43.236724,
        "long"=> 76.907814,
        "name"=> "БЭСТ, ассоциированная школа ЮНЕСКО"
      ],
      [
        "lat"=> 43.223092,
        "long"=> 76.842505,
        "name"=> "Общеобразовательная школа №117"
      ],
      [
        "lat"=> 43.291641,
        "long"=> 76.942116,
        "name"=> "Общеобразовательная школа №43"
      ],
      [
        "lat"=> 43.31052,
        "long"=> 76.944882,
        "name"=> "Общеобразовательная школа №74 им. С. Сейфуллина"
      ],
      [
        "lat"=> 43.187332,
        "long"=> 76.898155,
        "name"=> "Живая Вселенная, частная школа"
      ],
      [
        "lat"=> 43.235428,
        "long"=> 76.954496,
        "name"=> "Бакалавриат, частная школа"
      ],
      [
        "lat"=> 43.257146,
        "long"=> 76.815803,
        "name"=> "Школа-гимназия №201"
      ],
      [
        "lat"=> 43.19926,
        "long"=> 76.908454,
        "name"=> "Общеобразовательная школа №88"
      ],
      [
        "lat"=> 43.199271,
        "long"=> 76.87662,
        "name"=> "Общеобразовательная школа №45"
      ],
      [
        "lat"=> 43.289691,
        "long"=> 76.932228,
        "name"=> "Общеобразовательная школа №108"
      ],
      [
        "lat"=> 43.215905,
        "long"=> 76.900425,
        "name"=> "Голубой парус, школа-детский сад"
      ],
      [
        "lat"=> 43.265655,
        "long"=> 76.943826,
        "name"=> "Голубой парус, школа-детский сад"
      ],
      [
        "lat"=> 43.213252,
        "long"=> 76.847507,
        "name"=> "Школа-гимназия №202"
      ],
      [
        "lat"=> 43.216564,
        "long"=> 77.002228,
        "name"=> "Средняя школа №194"
      ],
      [
        "lat"=> 43.234737,
        "long"=> 76.836361,
        "name"=> "Общеобразовательная школа №121"
      ],
      [
        "lat"=> 43.241279,
        "long"=> 76.891049,
        "name"=> "Арман, учебно-воспитательный комплекс"
      ],
      [
        "lat"=> 43.196582,
        "long"=> 76.877091,
        "name"=> "Leader, школа"
      ],
      [
        "lat"=> 43.247628,
        "long"=> 76.955533,
        "name"=> "Alliance school, частная школа"
      ],
      [
        "lat"=> 43.176181,
        "long"=> 76.869674,
        "name"=> "Общеобразовательная школа №191 им. Г. Мустафина"
      ],
      [
        "lat"=> 43.206306,
        "long"=> 76.879624,
        "name"=> "Общеобразовательная школа №37"
      ],
      [
        "lat"=> 43.266845,
        "long"=> 76.863538,
        "name"=> "Общеобразовательная школа №41 им. Абдуллы Карсакбаева"
      ],
      [
        "lat"=> 43.255865,
        "long"=> 76.852093,
        "name"=> "Общеобразовательная школа №91"
      ],
      [
        "lat"=> 43.281157,
        "long"=> 76.880519,
        "name"=> "Общеобразовательная школа №151"
      ],
      [
        "lat"=> 43.31751,
        "long"=> 76.910851,
        "name"=> "Общеобразовательная школа №137 им. М. Жумабаева"
      ],
      [
        "lat"=> 43.24092,
        "long"=> 76.830983,
        "name"=> "Общеобразовательная школа №133"
      ],
      [
        "lat"=> 43.314268,
        "long"=> 76.966018,
        "name"=> "Общеобразовательная школа №17"
      ],
      [
        "lat"=> 43.325317,
        "long"=> 76.967827,
        "name"=> "Общеобразовательная школа №31"
      ],
      [
        "lat"=> 43.224661,
        "long"=> 76.928836,
        "name"=> "The Apple Tree, английский международный детский сад"
      ],
      [
        "lat"=> 43.209419,
        "long"=> 76.944847,
        "name"=> "Global Education, частная школа"
      ],
      [
        "lat"=> 43.18657,
        "long"=> 76.82962,
        "name"=> "Общеобразовательная школа №187"
      ],
      [
        "lat"=> 43.271856,
        "long"=> 76.84329,
        "name"=> "Общеобразовательная школа №149"
      ],
      [
        "lat"=> 43.251244,
        "long"=> 76.834618,
        "name"=> "Общеобразовательная школа №154 им. И.К. Мандоки"
      ],
      [
        "lat"=> 43.301365,
        "long"=> 76.872314,
        "name"=> "Школа-гимназия №152"
      ],
      [
        "lat"=> 43.300605,
        "long"=> 76.934786,
        "name"=> "Общеобразовательная школа №106"
      ],
      [
        "lat"=> 43.220094,
        "long"=> 76.836648,
        "name"=> "Общеобразовательная школа №155"
      ],
      [
        "lat"=> 43.280213,
        "long"=> 76.82396,
        "name"=> "Общеобразовательная школа №182"
      ],
      [
        "lat"=> 43.29718,
        "long"=> 76.851817,
        "name"=> "Общеобразовательная школа №26"
      ],
      [
        "lat"=> 43.231339,
        "long"=> 76.850422,
        "name"=> "Общеобразовательная школа №97"
      ],
      [
        "lat"=> 43.304611,
        "long"=> 76.899767,
        "name"=> "Общеобразовательная школа №87"
      ],
      [
        "lat"=> 43.224387,
        "long"=> 76.840343,
        "name"=> "Общеобразовательная школа №141"
      ],
      [
        "lat"=> 43.201697,
        "long"=> 76.841551,
        "name"=> "Общеобразовательная школа №158"
      ],
      [
        "lat"=> 43.237321,
        "long"=> 76.833012,
        "name"=> "Общеобразовательная школа №42"
      ],
      [
        "lat"=> 43.33005,
        "long"=> 76.947721,
        "name"=> "Общеобразовательная школа №61"
      ],
      [
        "lat"=> 43.318248,
        "long"=> 76.97843,
        "name"=> "Общеобразовательная школа №198"
      ],
      [
        "lat"=> 43.318254,
        "long"=> 76.934656,
        "name"=> "Общеобразовательная школа №49"
      ],
      [
        "lat"=> 43.322634,
        "long"=> 76.885531,
        "name"=> "Общеобразовательная школа №156"
      ],
      [
        "lat"=> 43.250943,
        "long"=> 76.846733,
        "name"=> "Общеобразовательная школа №82"
      ],
      [
        "lat"=> 43.215061,
        "long"=> 76.876765,
        "name"=> "Общеобразовательная школа №72"
      ],
      [
        "lat"=> 43.244161,
        "long"=> 76.816687,
        "name"=> "Общеобразовательная школа №181"
      ],
      [
        "lat"=> 43.224381,
        "long"=> 76.84952,
        "name"=> "Parasat Almaty, частная школа"
      ],
      [
        "lat"=> 43.312055,
        "long"=> 76.84094,
        "name"=> "Средняя школа №180"
      ],
      [
        "lat"=> 43.271871,
        "long"=> 76.844837,
        "name"=> "Общеобразовательная школа №171"
      ],
      [
        "lat"=> 43.169563,
        "long"=> 76.850116,
        "name"=> "Общеобразовательная школа №192 им. Рахима Сарсенбина"
      ],
      [
        "lat"=> 43.257211,
        "long"=> 76.937016,
        "name"=> "Innovative school, частная школа"
      ],
      [
        "lat"=> 43.284867,
        "long"=> 76.886961,
        "name"=> "Общеобразовательная школа №150 им. М. Хамраева"
      ],
      [
        "lat"=> 43.33619,
        "long"=> 76.944017,
        "name"=> "Общеобразовательная школа №76"
      ],
      [
        "lat"=> 43.334568,
        "long"=> 76.948278,
        "name"=> "Школа-гимназия №59"
      ],
      [
        "lat"=> 43.157617,
        "long"=> 76.900932,
        "name"=> "Общеобразовательная школа №190 им. Ш. Кудайбердыулы"
      ],
      [
        "lat"=> 43.326826,
        "long"=> 76.918767,
        "name"=> "Общеобразовательная школа №129"
      ],
      [
        "lat"=> 43.209865,
        "long"=> 76.817909,
        "name"=> "Almaty International School, частная школа"
      ],
      [
        "lat"=> 43.20221,
        "long"=> 76.870171,
        "name"=> "Ассоциированная школа ЮНЕСКО, при КАУ"
      ],
      [
        "lat"=> 43.336143,
        "long"=> 76.977053,
        "name"=> "Общеобразовательная школа №170"
      ],
      [
        "lat"=> 43.2969,
        "long"=> 77.025999,
        "name"=> "Общеобразовательная средняя школа №28 с дошкольным миницентром"
      ],
      [
        "lat"=> 43.269646,
        "long"=> 76.860956,
        "name"=> "Общеобразовательная школа №41 им. Абдуллы Карсакбаева"
      ],
      [
        "lat"=> 43.335917,
        "long"=> 76.913223,
        "name"=> "Общеобразовательная школа №160"
      ],
      [
        "lat"=> 43.23849,
        "long"=> 76.83796,
        "name"=> "Арай, частная средняя школа"
      ],
      [
        "lat"=> 43.336275,
        "long"=> 76.911477,
        "name"=> "Общеобразовательная школа №164"
      ],
      [
        "lat"=> 43.333469,
        "long"=> 76.941246,
        "name"=> "Школа-гимназия №59"
      ],
      [
        "lat"=> 43.331159,
        "long"=> 77.018731,
        "name"=> "Общеобразовательная школа №203"
      ],
      [
        "lat"=> 43.30485,
        "long"=> 77.043539,
        "name"=> "Средняя школа гимназия №45 Талгарского района"
      ],
      [
        "lat"=> 43.334807,
        "long"=> 76.96898,
        "name"=> "Голубой парус, школа-детский сад"
      ],
      [
        "lat"=> 43.226938,
        "long"=> 77.049197,
        "name"=> "Средняя школа №197"
      ],
      [
        "lat"=> 43.31672,
        "long"=> 77.054795,
        "name"=> "Средняя школа №31"
      ],
      [
        "lat"=> 43.323891,
        "long"=> 77.064653,
        "name"=> "Средняя школа №13"
      ],
      [
        "lat"=> 43.249115,
        "long"=> 76.881149,
        "name"=> "BEST FUTURE, образовательный центр"
      ],
      [
        "lat"=> 43.328304,
        "long"=> 76.968325,
        "name"=> "Новое начало, школа"
      ],
      [
        "lat"=> 43.237652,
        "long"=> 76.940264,
        "name"=> "НОЦ Innovation, организация по проведению международных олимпиад и конкурсов"
      ],
      [
        "lat"=> 43.299358,
        "long"=> 77.048673,
        "name"=> "Средняя школа №29"
      ],
      [
        "lat"=> 43.206808,
        "long"=> 76.852394,
        "name"=> "Білім әлемі, Частная школа"
      ],
      [
        "lat"=> 43.337429,
        "long"=> 76.882237,
        "name"=> "Средняя школа №23 Илийского района"
      ]
    ];

    foreach ($schools as $school) {
      \App\School::firstOrCreate($school);
    }
  }
}
