<?php
/**
 * Created by PhpStorm.
 * User: gorbunov
 * Date: 14.07.2018
 * Time: 14:47
 */

class ServiceTypeSeeder extends \Illuminate\Database\Seeder
{
    public function run()
    {
        $items = [
            "ДВД 102",
            "СГО РК",
            "ДКНБ РК",
            "ЦОУ ДВД",
            "ОД Прокуратура",
            "Транспортная прокуратура ОД",
            "ДУИС",
            "Деп. по делам обороны/нац гвардия",
            "СМП 103",
            "ЦМК",
            "ДОБ",
            "ОД ЦМКГУ",
            "ОД ЦМКОД",
            "Деп. охраны общественного здоровья города Алматы",
            "Деп. Экологии",
            "СЭС",
            "ЦДНМП28",
            "Служба газа 104",
            "Электросети",
            "Горводоканал",
            "Водоканал",
            "Теплосети",
            "Гор.свет (уличное освещение)",
            "Алматы тазалык",
            "Канализация",
            "Алматылифт",
            "Казахавтодор (по закрытию дорог)",
            "ССА",
            "РГП Казавиаспас",
            "ГУ РОСО",
            "ГУ Казселезащита",
            "Служба спасения Алматы",
            "РАЙОНЫЙ ОТДЕЛ ЧС",
            "Служба химической и радиационной защиты",
            "Казавиалесохрана"

        ];

        foreach ($items as $item) {
            \App\Models\ServiceType::firstOrCreate([
                'name' => $item
            ]);
        }
    }
}