<?php

return [
    'fireObject' => [
        'fire' => 'Пожар',
        'kitchenFire' => 'Пища на газе и задымление при неиспр.быт.эл.приборов',
        'electricFire' => 'КЗ эл.сетей и эл.оборудования',
        'trashFireOther' => 'Загорание сухостоя, мусора на отк.территориях, в контейнерах',
        'trashFireHouse' => 'Загорание мусора на тер.объекта,дома(лифт,мусоросб,л.клетка,подв,черд)',
        'falseCall' => 'Ложный',
        'asr' => 'АСР',
        'workFire' => 'Кровельные, битумные, сварочные работы',
        'peopleCall' => 'Бдительность населения',
        'orphanFire' => 'Загорание бесхозных зданий, транспортных средств',
        'otherFire' => 'Прочие случаи загорания',
        'regionFire' => 'Область',
        'technologyFire' => 'Технологический процесс',
        'pyrophoricFire' => 'Самовозгорание пирофорных соединений, без последствий и ущерба',
        'alarm' => 'Срабатывание сигнализации',
        'airFire' => 'Пожары, в рез-те авиа, ж/д аварии, тер.актов и пр., землетрясения',
        'suicide' => 'Покушение на самоубийство',
        'dischargesElectr' => 'Вспышки и разряды стат.электричества',
        'carbonPoisoning' => 'Отравление угарным газом',
        'naturalPoisoning' => 'Отравление природным газом',
    ],
    'burntObject' => [
        'transport' => 'Транспорт',
        'other' => 'Прочие'
    ]

];