<?php

return array(
    '/reports/call-infos' => [
        'title' => 'Информация по звонкам',
        'total' => 'Общее количество принятых сообщений (звонков)',
        '112' => 'По основной деятельности "112"',
        'line' => 'По линни ":line"',
        'info' => 'Информационно – справочного характера',
        'other' => 'Прочее (проверка сотовых телефонов, шалость детей и т.д.)',
        'info_by_date' => 'Информация по звонкам за дату :date (редактировать)',
        'info_date_period' => 'Информация по звонкам за :date_from по :date_to',
        'info_period' => 'Сведения о количестве звонков поступивших на номер «:number» с 07.00 :date_from до 07.00 :date_to года УКС ДЧС г. Алматы',
        'detail' => 'Из них',
    ],
);